{
	"name": "English",
	"flag": "🇺🇸",
	"axiom": [
		"Make crease {{x}} by folding through {{p0}} and {{p1}}.",
		"Make crease {{x}} by bringing {{p0}} to {{p1}}.",
		"Make crease {{x}} by bringing {{l0}} to {{l1}}.",
		"Make crease {{x}} by bringing {{l0}} onto itself, passing through {{p0}}.",
		"Make crease {{x}} by bringing {{p0}} to {{l0}}, passing through {{p1}}.",
		"Make crease {{x}} by bringing {{p0}} to {{l0}} and {{p1}} to {{l1}}.",
		"Make crease {{x}} by bringing {{l1}} onto itself and bringing {{p0}} to {{l0}}."
	],
	"axiom_solution": [
		"The solution is made by folding through {{p0}} and {{p1}}.",
		"The solution is made by bringing {{p0}} to {{p1}}.",
		"The solution is made by bringing {{l0}} to {{l1}}.",
		"The solution is made by bringing {{l0}} onto itself, passing through {{p0}}.",
		"The solution is made by bringing {{p0}} to {{l0}}, passing through {{p1}}.",
		"The solution is made by bringing {{p0}} to {{l0}} and {{p1}} to {{l1}}.",
		"The solution is made by bringing {{l1}} onto itself and bringing {{p0}} to {{l0}}."
	],
	"pinch": "Pinch only at the intersection.",
	"intersection": "Point {{x}} is at the intersection of {{l0}} and {{l1}}.",
	"intersection_solution": "The solution is at the intersection of {{l0}} and {{l1}}.",
	"paper": {
		"ne": "the top right corner",
		"se": "the bottom right corner",
		"sw": "the bottom left corner",
		"nw": "the top left corner",
		"n": "the top edge",
		"e": "the right edge",
		"s": "the bottom edge",
		"w": "the left edge",
		"sw_ne": "the upward diagonal",
		"nw_se": "the downward diagonal"
	},
	"statistics": {
		"_": "Statistics",
		"trials": "Trials",
		"summary": {
			"_": "Summary",
			"total": "Total trials",
			"average": "Average",
			"stdDev": "Standard deviation",
			"runTime": "Run time"
		},
		"errorDist": "Error distribution"
	},
	"settings": {
		"reset": "Reset to defaults",
		"reInit": "Requires re-initializing.",
		"basic": {
			"_": "Basic",
			"width": "Sheet width",
			"height": "Sheet height",
			"axioms": {
				"_": "Huzita-Hatori axioms",
				"O1": "Crease through two points.",
				"O2": "Two points together.",
				"O3": "Line to another line.",
				"O4": "Line to self, crease through point.",
				"O5": "Point to line, crease through point.",
				"O6": "Two points to two lines.",
				"O7": "Line to self, point to line."
			}
		},
		"advanced": {
			"_": "Advanced"
		},
		"display": {
			"theme": {
				"system": "System",
				"light": "Light",
				"dark": "Dark",
				"_": "Theme"
			},
			"showAxiom": "Show axiom number in description.",
			"showInit": "Show initialization progress.",
			"precision": "Precision",
			"_": "Display"
		}
	},
	"help": {
		"maxRank": "This sets the maximum rank for any sequence, which is the number of folds involved in the sequence. ReferenceFinder will calculate all marks and lines up to the maximum rank, subject to the two following limits. As a practical matter, you will rarely need to set this any larger than 6 or 7; rank 6 can include over a million distinct lines.",
		"maxLines": "This sets an absolute upper bound on the number of lines to calculate. Even if you are only searching for points, ReferenceFinder needs to calculate a large number of lines since points are defined by the intersections of existing lines.",
		"maxMarks": "This sets a absolute upper bound on the number of marks to calculate. As a rough estimate, if this setting is N, the average error in any given point is proportional to 1/(2*sqrt(N)). This is not exact, since points tend to cluster along low-rank lines, but as a good rule of thumb, half a million to a million points will give a good error performance.",
		"axioms": "The Huzita-Hatori Axioms group lets you choose which of the 7 axioms to include in the database. The default is to include all 7, but you can exclude one or more. Of course, the more axioms you exclude, the higher the rank you'll need to allow to obtain a given level of accuracy.",
		"divisions": "To avoid duplicates, ReferenceFinder keeps the lowest-rank sequence for any given mark or line. To specifically test for equivalence, the paper is divided up into a fine grid, according to the divisions settings. Two marks are considered equivalent if they fall within the same grid square, and only one of them will be kept.",
		"lineDivisions": "Lines are characterized by their angle and distance of closest approach to the origin, and so these two settings are similarly quantized.",
		"goodEnoughError": "When a search is performed, ReferenceFinder finds all marks (or lines) whose distance error (or an analogous quantity for lines) is better than this value. Essentially, this value is the error that you're willing to tolerate. Within this error, low-rank marks are considered more desirable (easier to fold) and so they will be displayed before higher-rank marks, even if the latter have lower errors.",
		"minAspectRatio": "As a practical matter, it is very difficult to fold a long, skinny corner so that the resulting crease is straight; it is very easy for the crease to wander. If a given sequence requires the folding of a triangular flap with an aspect ratio smaller than this, it is not accepted into the database. If you don't care about this issue, you can set the value to zero.",
		"minAngle": "Similarly, if two creases intersect at a very shallow angle, the location of the point at their intersection is inherently imprecise. This value is the sine of the minimum angle allowed for such intersections. If you don't care about this issue, you can set the value to zero.",
		"visibility": "If this is checked, then the only alignments that are allowed are those in which all reference points are visible with opaque paper. (In some alignments, one of the layers can conceal the relevant reference point.) If you are folding with translucent paper, you can uncheck this setting, which will allow a larger number of folding sequences to be considered.",
		"lineError": "If this is set to \"worst-case error\", then the error between two lines is calculated to be the worst-case separation between the two lines within the paper. Otherwise, we use the faster (but less accurate) Pythagorean difference between the parameters that define the line.",
		"statistics": "Perform a statistical analysis of the database. This command performs a series of trials, picking random points within the paper, finding the folding sequence that gives the closest mark, and then computing the error between the two. The resulting error is binned and reported at the end of the analysis. This command is useful primarily for comparing the performance of different database settings; you will not ordinarily use it."
	},
	"tip": {
		"title": "Tip:",
		"origin": "The origin of coordinates is at the lower left corner.",
		"exp": "You can use math expression such as {{exp}} (trigonometry functions uses degrees)."
	},
	"phrase": {
		"settings": "settings",
		"point": "point",
		"line": "line",
		"error": "error",
		"solution": "solution",
		"go": "go",
		"initializing": "Initializing...",
		"findLine": "find a line",
		"findPoint": "find a point",
		"referenceFinder": "ReferenceFinder",
		"coreVer": "Core version"
	},
	"invalid": {
		"exp": "Should be a number at least 0, or an equivalent expression",
		"expMax": "Should be a number from 0 to {{max}}, or an equivalent expression",
		"int": "Should be an integer at least {{min}}",
		"intMax": "Should be an integer from {{min}} to {{max}}"
	},
	"keyword": {
		"cancel": "cancel",
		"ok": "OK"
	}
}
